###############################################################################
# Created by write_sdc
###############################################################################
current_design picosoc_ihp
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_core -period 20.0000 [get_pins {sg13g2_IOPad_io_clock/p2c}]
set_clock_transition 0.2500 [get_clocks {clk_core}]
set_clock_uncertainty 0.1500 clk_core
set_propagated_clock [get_clocks {clk_core}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_col_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_crs_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_dv_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_rx_data_0_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_rx_data_1_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_rx_data_2_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_rx_data_3_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_rx_er_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_clk_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_resetn_PAD}]
set_input_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_ser_rx_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_flash_clk_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_flash_csb_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_flash_io0_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_flash_io1_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_flash_io2_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_flash_io3_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_mii_clk_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_mii_data_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_rst_n_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_data_0_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_data_1_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_data_2_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_data_3_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_en_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_phy_tx_er_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_pps_led_100ms_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_pps_pin_1cycle_PAD}]
set_output_delay 3.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_ser_tx_PAD}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 1.0000 [get_ports {io_clk_PAD}]
set_load -pin_load 1.0000 [get_ports {io_flash_clk_PAD}]
set_load -pin_load 1.0000 [get_ports {io_flash_csb_PAD}]
set_load -pin_load 1.0000 [get_ports {io_flash_io0_PAD}]
set_load -pin_load 1.0000 [get_ports {io_flash_io1_PAD}]
set_load -pin_load 1.0000 [get_ports {io_flash_io2_PAD}]
set_load -pin_load 1.0000 [get_ports {io_flash_io3_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_col_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_crs_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_dv_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_mii_clk_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_mii_data_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rst_n_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rx_clk_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rx_data_0_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rx_data_1_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rx_data_2_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rx_data_3_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_rx_er_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_clk_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_data_0_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_data_1_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_data_2_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_data_3_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_en_PAD}]
set_load -pin_load 1.0000 [get_ports {io_phy_tx_er_PAD}]
set_load -pin_load 1.0000 [get_ports {io_pps_led_100ms_PAD}]
set_load -pin_load 1.0000 [get_ports {io_pps_pin_1cycle_PAD}]
set_load -pin_load 1.0000 [get_ports {io_resetn_PAD}]
set_load -pin_load 1.0000 [get_ports {io_ser_rx_PAD}]
set_load -pin_load 1.0000 [get_ports {io_ser_tx_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_clk_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_flash_clk_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_flash_csb_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_flash_io0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_flash_io1_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_flash_io2_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_flash_io3_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_col_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_crs_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_dv_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_mii_clk_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_mii_data_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_rst_n_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_rx_data_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_rx_data_1_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_rx_data_2_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_rx_data_3_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_rx_er_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_clk_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_data_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_data_1_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_data_2_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_data_3_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_en_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_phy_tx_er_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pps_led_100ms_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pps_pin_1cycle_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_resetn_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_ser_rx_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_ser_tx_PAD}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_capacitance 0.5000 [current_design]
set_max_fanout 8.0000 [current_design]
