OpenROAD dcf36133a369abc8f3c5e5738cd4d82e4903c0e0 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
read_liberty /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/lib/sg13g2_io_typ_1p2V_3p3V_25C.lib
read_db ./results/ihp-sg13g2/picosoc_ihp/base/2_2_floorplan_macro.odb
source /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/setRC.tcl
[INFO ODB-0303] The initial 528 rows (2199648 sites) were cut with 5 shapes for a total of 781 rows (1864399 sites).
write_db ./results/ihp-sg13g2/picosoc_ihp/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.78[h:]min:sec. CPU time: user 0.68 sys 0.10 (100%). Peak memory: 164264KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            160 efabb53865a3af9535ff
