OpenROAD dcf36133a369abc8f3c5e5738cd4d82e4903c0e0 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
read_liberty /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/lib/sg13g2_io_typ_1p2V_3p3V_25C.lib
read_db ./results/ihp-sg13g2/picosoc_ihp/base/3_1_place_gp_skip_io.odb
source /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/setRC.tcl
place_pins -hor_layers Metal3 -ver_layers Metal2
Found 5 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 12484
[INFO PPL-0002] Number of I/O             3
[INFO PPL-0003] Number of I/O w/sink      0
[INFO PPL-0004] Number of I/O w/o sink    3
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 0.00 um.
write_db ./results/ihp-sg13g2/picosoc_ihp/base/3_2_place_iop.odb
Elapsed time: 0:00.94[h:]min:sec. CPU time: user 0.82 sys 0.12 (100%). Peak memory: 215968KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            210 0a5f6e5295f380f85e88
