OpenROAD dcf36133a369abc8f3c5e5738cd4d82e4903c0e0 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
read_liberty /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/lib/sg13g2_io_typ_1p2V_3p3V_25C.lib
read_db ./results/ihp-sg13g2/picosoc_ihp/base/5_2_route.odb
source /home/ubuntu/Documents/asictest/OpenROAD-flow-scripts/flow/platforms/ihp-sg13g2/setRC.tcl
filler_placement "sg13g2_fill_1 sg13g2_fill_2 sg13g2_decap_4 sg13g2_decap_8"
[INFO DPL-0001] Placed 230394 filler instances.
write_db ./results/ihp-sg13g2/picosoc_ihp/base/5_3_fillcell.odb
Elapsed time: 0:03.41[h:]min:sec. CPU time: user 3.11 sys 0.30 (100%). Peak memory: 480292KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       3            469 2ab4376ca43312ea072f
